In [1]:
import pandas as pd

In [4]:
df = pd.read_csv('salary.tsv', sep='\t', header=None)

In [7]:
display(df)

,ssn,occupation,education,salary,gender,exp_group
0,a100050102,other-worker,certificate-iv,78359,m,4 21+
1,a100091149,ict-technician,certificate-iii,104897,m,2 5-10
2,a100248307,personal-services-worker,certificate-ii,78420,m,3 11-20
3,a100568525,ict-technician,diploma,101191,f,4 21+
4,a100600797,personal-services-worker,certificate-i,60084,m,3 11-20
...,...,...,...,...,...,...
9583,i199761171,health-support-worker,certificate-ii,61694,m,3 11-20
9584,i199840951,art-media-professional,advance-diploma,103367,m,1 0-5
9585,i199940217,automotive-worker,certificate-iii,91101,f,1 0-5
9586,i199953012,ict-professional,advance-diploma,87913,m,3 11-20
9587,i199996413,farm-worker,senior-secondary-school,16152,m,4 21+

In [6]:
df.columns = ['ssn', 'occupation', 'education', 'salary', 'gender', 'exp_group']

In [13]:
sal_df = df.groupby(['occupation', 'gender']).median()['salary'].reset_index()

In [25]:
sal_df.loc[(sal_df['occupation'] == 'automotive-worker') & (sal_df['gender'] == 'm')]['salary'].values.tolist()[0]

74002.5

In [43]:
sal_df.to_csv('median_salaries.csv', index=False)

In [36]:
def get_salary(row):
    occupation = row['occupation']
    gender = row['gender_clean']
    try:
        salary = sal_df.loc[(sal_df['occupation'] == occupation) & (sal_df['gender'] == gender)]['salary'].values.tolist()[0]
        return salary
    except IndexError:
        return row['salary_clean']

In [37]:
df_j = pd.read_csv('joined.tsv', sep='\t')

In [40]:
display(df_j)

,ssn,fname_clean,mname_clean,lname_clean,gender_clean,consult_age_clean,birth_date_dt,medicare_number,street_address_clean,suburb_clean,...,consult_ts,rec_id,education,occupation,salary_clean,salary,credit_card_number,years_of_experience,employ_ts,salary_fix
0,a100050102,justin,elton,verga,m,36,1980-06-07,8250 99889 1 2,40 marcus clarke street canberra house,canberra city,...,2016-01-26 06:44:00+00:00,r15002000,certificate-iv,other-worker,78359.0,78359.0,7426 3365 3452 2350,21,2020-04-15 13:24:00+00:00,75420.5
1,a100091149,christopher,jerome,herring,m,21,1995-10-20,2939 34141 2 3,17 inner harbour drive marina palms,patterson lakes,...,2016-07-18 13:58:00+00:00,r90040119,certificate-iii,ict-technician,104897.0,104897.0,7356 0165 1634 7804,6,2020-06-13 01:21:00+00:00,111124.5
2,a100091149,christopher,jerome,herring,m,21,1995-10-20,2939 34141 2 3,17 inner harbour drive marina palms,patterson lakes,...,2016-07-18 13:58:00+00:00,r09110940,certificate-iii,ict-technician,104897.0,104897.0,7356 0165 1634 7804,6,2020-06-13 01:21:00+00:00,111124.5
3,a100222723,billy,david,ross,m,15,1998-05-17,5417 95547 2 3,41 cavenagh street plaza bldg,darwin,...,2013-03-26 21:59:00+00:00,r23272200,secondary-school,machinary-driver,NaN,NaN,5837 2758 2366 5640,3,2020-04-05 06:45:00+00:00,14860.0
4,a100248307,howard,stephen,turner,m,36,1985-01-09,6472 28876 1 1,1351 sidonia road balkebah,baynton,...,2020-07-23 06:51:00+00:00,r20407803,certificate-ii,personal-services-worker,78420.0,78420.0,3951 5724 9004 2669,15,2019-09-27 12:53:00+00:00,55624.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
16889,i199840951,evan,maston,bruno,m,23,1996-04-03,4352 69591 2 3,42 borenore lane kenvale,borenore,...,2018-12-19 16:05:00+00:00,r40995189,advance-diploma,art-media-professional,103367.0,103367.0,4496 1676 9466 2010,5,2020-04-02 07:41:00+00:00,115695.0
16890,i199919157,jillian,erin,perell,f,33,1984-11-22,3005 36572 1 1,3 collins close masonic vlge,lake haven,...,2017-08-18 00:14:00+00:00,r19995719,advance-diploma,education-professional,NaN,NaN,9392 1545 1088 9225,17,2020-02-16 06:38:00+00:00,117127.5
16891,i199940217,martha,renee,jackson,f,15,2000-05-11,8818 54716 2 2,22 mitchell street central specialist clinic,darwin,...,2015-07-11 01:52:00+00:00,r97914920,certificate-iii,automotive-worker,91101.0,91101.0,8278 6665 0763 8863,1,2020-05-20 04:18:00+00:00,76694.0
16892,i199953012,thomas,joseph,petty,m,27,1989-04-22,9821 42905 2 2,20 dalley street st vincents private hospital,lismore,...,2016-06-08 08:10:00+00:00,r91953920,advance-diploma,ict-professional,87913.0,87913.0,5666 8118 7243 3499,12,2020-04-17 18:38:00+00:00,113279.5
16893,i199996413,monroe,lamonte,collier,m,47,1971-02-07,4419 58367 1 1,1 harveys road oberland,armidale,...,2018-03-12 03:34:00+00:00,r99934619,senior-secondary-school,farm-worker,16152.0,16152.0,4264 4192 1712 6497,30,2020-03-12 15:13:00+00:00,16004.0

In [39]:
df_j['salary_fix'] = df_j.apply(lambda row: get_salary(row), axis=1)

In [42]:
df_j.to_csv('joined_w_salary.csv', index=False)